Revit 2027 API
AssetPropertyList.SetValue Method
 Sets collection of properties stored in this property list.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetValue(
	IList<AssetProperty> value
)
Public Sub SetValue (
	value As IList(Of AssetProperty)
)
public:
void SetValue(
	IList<AssetProperty^>^ value
)
member SetValue :
        value : IList<AssetProperty> -> unit
Parameters
value IList<AssetProperty>
 An array of properties.
Exceptions
Exception | Condition
ArgumentException |  The input value is invalid for this AssetPropertyList property.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The asset property is not editable.
Remarks
 All the properties in the list are of the same AssetPropertyType. The AssetPropertyType can only be Integer, Double4, Float or Double, Enumeration.
See Also
Reference
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace